topics/ubuntu-hands-off/index.html
<!DOCTYPE html>
<html lang="en">
  <head>
    
    <meta charset="utf-8">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
    
    <title>They Call Me Brett</title>
    
    
    <link rel="stylesheet" href="http://localhost/~bv/static/bootstrap/css/bootstrap.min.css">
    
    <link rel="stylesheet" href="http://localhost/~bv/static/font-awesom/css/font-awesome.min.css">
    
    <link rel="stylesheet" href="http://localhost/~bv/static/themes/yeti/css/base.css">
    
    <link rel="stylesheet" href="http://localhost/~bv/static/highlight/styles/default.css">
    
    <link rel="stylesheet" href="http://localhost/~bv/static/octicons/octicons.css">
    
    

    
  </head>
  
  <body>
    

    <div class="navbar navbar-default navbar-fixed-top" role="navigation">
      <div class="container">

        
        <div class="navbar-header">
          
          
          <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>

          
          <a class="navbar-brand" href="..">They Call Me Brett</a>
        </div><!-- navbar-header -->

        
        <div class="navbar-collapse collapse">
          
          
          <ul class="nav navbar-nav">
	    
	    
	    
	    <li><a href="topics.html">Articles</a></li>
	    
	    
	    <li><a href="blog.html">Blog</a></li>
	    
	    
	    <li><a href="feed.html">Feeds</a></li>
	    
	    
          </ul>
          
          
          <ul class="nav navbar-nav navbar-right">
	    
            <li >
              <a rel="up" href="..">
                <i class="fa fa-arrow-up"></i> Up
              </a>
            </li>
	    
          </ul>
        </div>

      </div><!-- container -->
    </div><!-- navbar -->

    <div class="container">
      
      <div class="col-md-3">
        <div class="bs-sidebar hidden-print affix well" role="complementary">
          <ul class="nav bs-sidenav">
            <li class="main active"><a href="#">Top</a></li>
	    
<li class="">
  <a href="#sec-1">1. Overview of installation</a></li>
<li class="">
  <a href="#sec-2">2. Capture MAC addresses</a></li>
<li class="">
  <a href="#sec-3">3. Configure installation server</a><ul class="nav">
<li class="">
  <a href="#sec-3-1">3.1. PXE/DHCP/TFTP</a></li>
<li class="">
  <a href="#sec-3-2">3.2. Prepare TFTP file area</a></li>
<li class="">
  <a href="#sec-3-3">3.3. Preseeding</a></li></ul></li>

	  </ul>
	</div>
      </div>
      
      <div class="col-md-9" role="main">

	<h1 class="page-title">
	  
Hands-off installation of Ubuntu

	  <small>
</small>
	</h1>
      
	<p/>
	
	

2015-03-29 14:40:24<blockquote>Install Ubuntu without touching the hardware.</blockquote>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview of installation</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Capture MAC address of computer
</li>
<li>Enter it into system
</li>
<li>Turn computer on, booting with netboot
</li>
<li>Computer loads pxelinux bootloader over the network
</li>
<li>PXELinux boots Ubuntu netboot with preseed file
</li>
<li>Enter BIOS to turn off netboot
</li>
<li>After installation, use ansible/puppet to polish off
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Capture MAC addresses</h2>
<div class="outline-text-2" id="text-2">
<p>
Boot to BIOS or run <code>tcpdump -qtel broadcast and port bootpc</code> while
target machine boots.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Configure installation server</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> PXE/DHCP/TFTP</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Local network has untouchable DHCP server, use <a href="http://www.thekelleys.org.uk/dnsmasq/doc.html">dnsmasq</a> to provide
proxyDHCP and TFTP.
</p>

<pre class="example">
$ sudo apt-get install dnsmasq
</pre>

<p>
Add to <code>/etc/dnsmasq.conf</code>
</p>
<pre class="example">
# Ubuntu sets up to use self for resolving and resolv.conf lists
# localhost so avoid self reference
no-resolv

# Router is real DNS server
server=192.168.1.1

# limit what interface to listen on
interface=eth0
# probably partly redudant
listen-address=127.0.0.1,192.168.1.123

# load aux config chunks
conf-dir=/etc/dnsmasq.d
</pre>

<p>
<code>/etc/dnsmasq.d/proxydhcp.conf</code>
</p>
<pre class="example">
# log traffic info
log-dhcp
# Turn on the included TFTP server
enable-tftp
# Root directory for TFTP files
tftp-root=/var/lib/tftpboot
# PXE boot loader
dhcp-boot=pxelinux.0
# Act as proxyDHCP on given network
dhcp-range=192.168.1.0,proxy
# Ignore anybody we don't know
dhcp-ignore=tag:!known
# last arg is pxe file bootloader sans ".0"
pxe-service=x86PC, "Boot PXELinux", pxelinux
</pre>

<p>
<code>/etc/dnsmasq.d/known-hosts.conf</code>
</p>
<pre class="example">
dhcp-host=00:22:19:dc:2e:bb
</pre>

<p>
Put all known hosts in this file.  Any not listed will simply be ignored by <code>dnsmasq</code>.  Any changes to the config files requires a restart
</p>

<pre class="example">
# service dnsmasq restart
</pre>

<p>
Monitor dnsmasq with 
</p>

<pre class="example">
# tail -f /var/log/syslog
</pre>
</div>
</div>



<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Prepare TFTP file area</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Download netboot image:
</p>

<pre class="example">
# cd /var/lib/tftpboot
# for n in trusty utopic vivid 
&gt; do 
&gt;   mkdir $n
&gt;   wget -O- http://archive.ubuntu.com/ubuntu/dists/$n/main/installer-amd64/current/images/netboot/netboot.tar.gz | tar -C $n -xf -
&gt; done
# rm -rf pxelib
# mkdir pxelib
# cd pxelib
# ln -s ../$n/ubuntu-installer/amd64/boot-screens/*.c32 .
# cd ..
# ln -sf $n/ldlinux.c32 .
# ln -sf $n/pxelinux.0 .
</pre>

<p>
Configure.
</p>
</div>
</div>



<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Preseeding</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This takes crafting.
</p>
</div>
</div>
</div>



      <p/>
      </div><!-- main -->
      
      
    </div><!-- content container -->
    


    

    <footer class="col-md-12">
      
<hr/>
<a href="index.org">Org (index.org)</a><br>
<a href="index.pdf">PDF (index.pdf)</a><br>
<p>
  Created: 2015-03-29 14:40:24<br>
  Revised: 2015-03-29 14:40:24<br>

    </footer>

    
    
    
    <script src="http://localhost/~bv/static/jquery-1.12.0.min.js"></script>
    
    <script src="http://localhost/~bv/static/bootstrap/js/bootstrap.min.js"></script>
    
    <script src="http://localhost/~bv/static/highlight/highlight.pack.js"></script>
    
    <script src="http://localhost/~bv/static/joy.js"></script>
    
    
    
    
    
    
     
  </body>

</html>